# Table of Contents:
# 1. Introduction to Pandas
# 2. Creating Series and DataFrames
# 3. Loading and Exploring Data
# 4. Data Selection and Indexing
# 5. Data Cleaning and Handling Missing Values
# 6. Data Filtering and Querying
# 7. Data Aggregation and Grouping
# 8. Data Merging and Joining
# 9. Pivot Tables and Reshaping
# 10. Advanced Operations

In [48]:
import pandas as pd
import numpy as np
print("Pandas version:", pd.__version__)

Pandas version: 2.2.3

# ===========================================================
# 1. INTRODUCTION TO PANDAS
# ===========================================================


Pandas is a powerful data manipulation and analysis library for Python.
It provides two main data structures:
- Series: 1-dimensional labeled array
- DataFrame: 2-dimensional labeled data structure (like a spreadsheet)

Key Features:
- Easy handling of missing data
- Data alignment and merging
- Flexible reshaping and pivoting
- Powerful grouping functionality
- Time series functionality

# =================================================================
# 2. CREATING SERIES AND DATAFRAMES
# =================================================================

In [49]:
print("="*60)
print("2. CREATING SERIES AND DATAFRAMES")
print("="*60)

# Creating a Series
print("\n2.1 Creating Series:")
print("-" * 30)

# From a list
ages = pd.Series([25, 30, 35, 28, 45], name='Age')
print("Series from list:")
print(ages)

# From a dictionary
person_ages = pd.Series({'Alice': 25, 'Bob': 30, 'Charlie': 35, 'Diana': 28})
print("\nSeries from dictionary:")
print(person_ages)

# Series attributes
print(f"\nSeries shape: {ages.shape}")
print(f"Series dtype: {ages.dtype}")
print(f"Series index: {ages.index.tolist()}")
print(f"Series values: {ages.values}")

============================================================
2. CREATING SERIES AND DATAFRAMES
============================================================

2.1 Creating Series:
------------------------------
Series from list:
0    25
1    30
2    35
3    28
4    45
Name: Age, dtype: int64

Series from dictionary:
Alice      25
Bob        30
Charlie    35
Diana      28
dtype: int64

Series shape: (5,)
Series dtype: int64
Series index: [0, 1, 2, 3, 4]
Series values: [25 30 35 28 45]

In [3]:
# Creating a DataFrame
print("\n2.2 Creating DataFrames:")
print("-" * 30)

# From a dictionary
data_dict = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 45],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [50000, 60000, 75000, 55000, 80000]
}

df_sample = pd.DataFrame(data_dict)
print("DataFrame from dictionary:")
print(df_sample)

# From lists
names = ['Alice', 'Bob', 'Charlie']
ages = [25, 30, 35]
df_from_lists = pd.DataFrame({'Name': names, 'Age': ages})
print("\nDataFrame from lists:")
print(df_from_lists)

# DataFrame attributes
print(f"\nDataFrame shape: {df_sample.shape}")
print(f"DataFrame columns: {df_sample.columns.tolist()}")
print(f"DataFrame index: {df_sample.index.tolist()}")
print(f"DataFrame dtypes:\n{df_sample.dtypes}")

2.2 Creating DataFrames:
------------------------------
DataFrame from dictionary:
      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Paris   75000
3    Diana   28     Tokyo   55000
4      Eve   45    Sydney   80000

DataFrame from lists:
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

DataFrame shape: (5, 4)
DataFrame columns: ['Name', 'Age', 'City', 'Salary']
DataFrame index: [0, 1, 2, 3, 4]
DataFrame dtypes:
Name      object
Age        int64
City      object
Salary     int64
dtype: object

# =======================================
# 3. LOADING AND EXPLORING DATA
# =======================================

In [4]:
# Load the Titanic dataset
titanic=pd.read_csv('Titanic-Dataset.csv')

In [5]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
# Basic information about the dataset
print(f"Dataset shape: {titanic.shape}")
print(f"Number of rows: {len(titanic)}")
print(f"Number of columns: {len(titanic.columns)}")

Dataset shape: (891, 12)
Number of rows: 891
Number of columns: 12

In [7]:
# Display first few rows
print("\nFirst 5 rows:")
titanic.head()

First 5 rows:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
# Display last few rows
print("\nLast 5 rows:")
titanic.tail()

Last 5 rows:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
# Display random sample
print("\nRandom sample of 3 rows:")
titanic.sample(3)

Random sample of 3 rows:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
418,419,0,2,"Matthews, Mr. William John",male,30.0,0,0,28228,13.0000,NaN,S
352,353,0,3,"Elias, Mr. Tannous",male,15.0,1,1,2695,7.2292,NaN,C
321,322,0,3,"Danoff, Mr. Yoto",male,27.0,0,0,349219,7.8958,NaN,S

In [10]:
# Dataset info
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [11]:
# Describe numerical columns
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
# Check for missing values
print(titanic.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
# Check data types
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# =====================================================
# 4. DATA SELECTION AND INDEXING
# =====================================================

In [14]:
print("4. DATA SELECTION AND INDEXING")
print("="*60)

# Column selection
print("\n4.1 Column Selection:")
print("-" * 30)

# Single column (returns Series)
ages_series = titanic['Age']
print(f"Type of single column selection: {type(ages_series)}")
print(f"First 5 ages: {ages_series.head().tolist()}")

4. DATA SELECTION AND INDEXING
============================================================

4.1 Column Selection:
------------------------------
Type of single column selection: <class 'pandas.core.series.Series'>
First 5 ages: [22.0, 38.0, 26.0, 35.0, 35.0]

In [15]:
# Multiple columns (returns DataFrame)
passenger_info = titanic[['Age', 'Sex', 'Fare']]
print(f"\nType of multiple column selection: {type(passenger_info)}")
print("First 3 rows of passenger info:")
print(passenger_info.head(3))

Type of multiple column selection: <class 'pandas.core.frame.DataFrame'>
First 3 rows of passenger info:
    Age     Sex     Fare
0  22.0    male   7.2500
1  38.0  female  71.2833
2  26.0  female   7.9250

In [16]:
# Row selection using iloc (integer-location based)
print("\n4.2 Row Selection with iloc:")
print("-" * 30)

# Single row
first_passenger = titanic.iloc[0]
print(f"First passenger:\n{first_passenger}")
print(f"\nType of row selection: {type(first_passenger)}")

4.2 Row Selection with iloc:
------------------------------
First passenger:
PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

Type of row selection: <class 'pandas.core.series.Series'>

In [17]:
# Multiple rows
first_five = titanic.iloc[0:5]
print(f"\nFirst 5 passengers (shape: {first_five.shape}):")
print(first_five)
print(first_five[['Age', 'Sex', 'Fare']])

First 5 passengers (shape: (5, 12)):
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
    Age     Sex     Fare
0  22.0    male   7.2500
1  38.0  female  71.2833
2  26.0  female   7.9250
3  35.0  female  53.1000
4  35.0    male   8.0500

In [18]:
# Specific rows
specific_rows = titanic.iloc[[0, 5, 10]]
print(f"\nSpecific rows (0, 5, 10):")
print(specific_rows[['Age', 'Sex', 'Fare']])

# Row and column selection
print("\n4.3 Row and Column Selection:")
print("-" * 30)

# Select specific rows and columns
subset = titanic.iloc[0:5, 1:4]  # First 5 rows, columns 1-3
print("Subset (first 5 rows, columns 1-3):")
print(subset)

Specific rows (0, 5, 10):
     Age     Sex     Fare
0   22.0    male   7.2500
5    NaN    male   8.4583
10   4.0  female  16.7000

4.3 Row and Column Selection:
------------------------------
Subset (first 5 rows, columns 1-3):
   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

In [19]:
# Using column names with loc
age_sex_subset = titanic.loc[0:4, ['Age', 'Sex']]
print(f"\nUsing loc with column names:")
print(age_sex_subset)

Using loc with column names:
    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

# =====================================================
# 5. DATA CLEANING AND HANDLING MISSING VALUES
# =====================================================

In [20]:
print("\n" + "="*60)
print("5. DATA CLEANING AND HANDLING MISSING VALUES")
print("="*60)

print("\n5.1 Identifying Missing Values:")
print("-" * 30)

# Check for missing values
missing_counts = titanic.isnull().sum()
print("Missing values per column:")
print(missing_counts[missing_counts > 0])

============================================================
5. DATA CLEANING AND HANDLING MISSING VALUES
============================================================

5.1 Identifying Missing Values:
------------------------------
Missing values per column:
Age         177
Cabin       687
Embarked      2
dtype: int64

In [21]:
# Percentage of missing values
missing_percentage = (titanic.isnull().sum() / len(titanic)) * 100
print("\nPercentage of missing values:")
print(missing_percentage[missing_percentage > 0])

Percentage of missing values:
Age         19.865320
Cabin       77.104377
Embarked     0.224467
dtype: float64

In [22]:
print("\n5.2 Handling Missing Values:")
print("-" * 30)

# Create a copy for cleaning
titanic_clean = titanic.copy()

# Method 1: Drop rows with missing values
print(f"Original shape: {titanic_clean.shape}")
titanic_no_na = titanic_clean.dropna()
print(f"After dropping all NAs: {titanic_no_na.shape}")

5.2 Handling Missing Values:
------------------------------
Original shape: (891, 12)
After dropping all NAs: (183, 12)

In [23]:
# Method 2: Drop specific columns with missing values
titanic_drop_cols = titanic_clean.dropna(axis=1)
print(f"After dropping columns with NAs: {titanic_drop_cols.shape}")

After dropping columns with NAs: (891, 9)

In [24]:
# Method 3: Fill missing values
# Fill numerical missing values with median
if 'Age' in titanic_clean.columns:
    median_age = titanic_clean['Age'].median()
    titanic_clean['Age'].fillna(median_age, inplace=True)
    print(f"Filled missing ages with median: {median_age:.1f}")

Filled missing ages with median: 28.0

/tmp/ipykernel_40016/3511430015.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_clean['Age'].fillna(median_age, inplace=True)

In [25]:
# Fill categorical missing values with mode
if 'Embarked' in titanic_clean.columns:
    mode_embarked = titanic_clean['Embarked'].mode()[0]
    titanic_clean['Embarked'].fillna(mode_embarked, inplace=True)
    print(f"Filled missing embarked with mode: {mode_embarked}")

Filled missing embarked with mode: S

/tmp/ipykernel_40016/3985066062.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_clean['Embarked'].fillna(mode_embarked, inplace=True)

In [26]:
# Check missing values after cleaning
print(f"\nMissing values after cleaning: {titanic_clean.isnull().sum()}")

Missing values after cleaning: PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

# =====================================================
# 6. DATA FILTERING AND QUERYING
# =====================================================

In [27]:
print("6. DATA FILTERING AND QUERYING")

print("\n6.1 Basic Filtering:")

# Single condition
adults = titanic_clean[titanic_clean['Age'] >= 18]
print(f"Number of adults (Age >= 18): {len(adults)}")

6. DATA FILTERING AND QUERYING

6.1 Basic Filtering:
Number of adults (Age >= 18): 778

In [28]:
# Display first few adult passengers
print("First 3 adult passengers:")
print(adults[['Age', 'Sex', 'Survived']].head(3))

First 3 adult passengers:
    Age     Sex  Survived
0  22.0    male         0
1  38.0  female         1
2  26.0  female         1

In [29]:
# Multiple conditions using & (and) and | (or)

young_females = titanic_clean[(titanic_clean['Age'] < 30) & (titanic_clean['Sex'] == 'female')]
print(f"\nYoung females (Age < 30): {len(young_females)}")

Young females (Age < 30): 200

In [30]:
# High fare or first class
luxury_passengers = titanic_clean[(titanic_clean['Fare'] > 50) | (titanic_clean['Pclass'] == 1)]
print(f"Luxury passengers (fare > 50 OR first class): {len(luxury_passengers)}")

Luxury passengers (fare > 50 OR first class): 237

In [31]:
print("\n6.2 Using isin() Method:")
print("-" * 30)

# Filter using isin()
european_ports = titanic_clean[titanic_clean['Embarked'].isin(['C', 'S'])]
print(f"Passengers from European ports (C, S): {len(european_ports)}")

6.2 Using isin() Method:
------------------------------
Passengers from European ports (C, S): 814

In [32]:
print("\n6.3 Query Method:")
print("-" * 30)

# Using query method for complex conditions
query_result = titanic_clean.query('Age > 30 and Fare < 20')
print(f"Passengers with age > 30 and fare < 20: {len(query_result)}")

# Query with string conditions
if 'Sex' in titanic_clean.columns:
    female_survivors = titanic_clean.query('Sex == "female" and Survived == 1')
    print(f"Female survivors: {len(female_survivors)}")

6.3 Query Method:
------------------------------
Passengers with age > 30 and fare < 20: 133
Female survivors: 233

In [33]:
# =============================================================================
# 7. DATA AGGREGATION AND GROUPING
# =============================================================================

print("\n" + "="*60)
print("7. DATA AGGREGATION AND GROUPING")
print("="*60)

print("\n7.1 Basic Aggregations:")
print("-" * 30)

# Basic statistics
if 'Age' in titanic_clean.columns:
    print(f"Mean age: {titanic_clean['Age'].mean():.1f}")
    print(f"Median age: {titanic_clean['Age'].median():.1f}")
    print(f"Standard deviation of age: {titanic_clean['Age'].std():.1f}")

if 'Fare' in titanic_clean.columns:
    print(f"Average fare: ${titanic_clean['Fare'].mean():.2f}")
    print(f"Maximum fare: ${titanic_clean['Fare'].max():.2f}")

============================================================
7. DATA AGGREGATION AND GROUPING
============================================================

7.1 Basic Aggregations:
------------------------------
Mean age: 29.4
Median age: 28.0
Standard deviation of age: 13.0
Average fare: $32.20
Maximum fare: $512.33

In [34]:
print("\n7.2 Value Counts:")
print("-" * 30)

# Count unique values
if 'Sex' in titanic_clean.columns:
    print("Sex distribution:")
    print(titanic_clean['Sex'].value_counts())

if 'Pclass' in titanic_clean.columns:
    print("\nClass distribution:")
    print(titanic_clean['Pclass'].value_counts().sort_index())

# Proportions
if 'Survived' in titanic_clean.columns:
    print("\nSurvival rate:")
    survival_rate = titanic_clean['Survived'].value_counts(normalize=True)
    print(survival_rate)

7.2 Value Counts:
------------------------------
Sex distribution:
Sex
male      577
female    314
Name: count, dtype: int64

Class distribution:
Pclass
1    216
2    184
3    491
Name: count, dtype: int64

Survival rate:
Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [35]:
print("\n7.3 GroupBy Operations:")
print("-" * 30)

# Group by single column
if 'Sex' in titanic_clean.columns and 'Age' in titanic_clean.columns:
    age_by_sex = titanic_clean.groupby('Sex')['Age'].mean()
    print("Average age by sex:")
    print(age_by_sex)

# Group by multiple columns
if 'Sex' in titanic_clean.columns and 'Pclass' in titanic_clean.columns:
    survival_by_sex_class = titanic_clean.groupby(['Sex', 'Pclass'])['Survived'].mean()
    print("\nSurvival rate by sex and class:")
    print(survival_by_sex_class)

7.3 GroupBy Operations:
------------------------------
Average age by sex:
Sex
female    27.929936
male      30.140676
Name: Age, dtype: float64

Survival rate by sex and class:
Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [36]:
# Multiple aggregations
print("\n7.4 Multiple Aggregation Functions:")
print("-" * 30)

if 'Fare' in titanic_clean.columns and 'Pclass' in titanic_clean.columns:
    fare_stats = titanic_clean.groupby('Pclass')['Fare'].agg(['mean', 'median', 'std', 'count'])
    print("Fare statistics by class:")
    print(fare_stats)

7.4 Multiple Aggregation Functions:
------------------------------
Fare statistics by class:
             mean   median        std  count
Pclass
1       84.154687  60.2875  78.380373    216
2       20.662183  14.2500  13.417399    184
3       13.675550   8.0500  11.778142    491

In [37]:
# =============================================================================
# 8. DATA MERGING AND JOINING
# =============================================================================

print("\n" + "="*60)
print("8. DATA MERGING AND JOINING")
print("="*60)

# Create sample datasets for merging
print("\n8.1 Creating Sample Data for Merging:")
print("-" * 30)

# Passenger details
passenger_details = pd.DataFrame({
    'passenger_id': [1, 2, 3, 4, 5],
    'name': ['Alice Johnson', 'Bob Smith', 'Charlie Brown', 'Diana Prince', 'Eve Wilson'],
    'ticket_class': [1, 2, 3, 1, 2]
})

# Ticket information
ticket_info = pd.DataFrame({
    'passenger_id': [1, 2, 3, 6, 7],
    'ticket_number': ['A123', 'B456', 'C789', 'D012', 'E345'],
    'fare_paid': [100, 75, 50, 120, 80]
})

print("Passenger Details:")
print(passenger_details)
print("\nTicket Information:")
print(ticket_info)

============================================================
8. DATA MERGING AND JOINING
============================================================

8.1 Creating Sample Data for Merging:
------------------------------
Passenger Details:
   passenger_id           name  ticket_class
0             1  Alice Johnson             1
1             2      Bob Smith             2
2             3  Charlie Brown             3
3             4   Diana Prince             1
4             5     Eve Wilson             2

Ticket Information:
   passenger_id ticket_number  fare_paid
0             1          A123        100
1             2          B456         75
2             3          C789         50
3             6          D012        120
4             7          E345         80

In [38]:
print("\n8.2 Different Types of Merges:")
print("-" * 30)

# Inner join (default)
inner_merge = pd.merge(passenger_details, ticket_info, on='passenger_id')
print("Inner Join (only matching records):")
print(inner_merge)

# Left join
left_merge = pd.merge(passenger_details, ticket_info, on='passenger_id', how='left')
print("\nLeft Join (all records from left table):")
print(left_merge)

# Right join
right_merge = pd.merge(passenger_details, ticket_info, on='passenger_id', how='right')
print("\nRight Join (all records from right table):")
print(right_merge)

# Outer join
outer_merge = pd.merge(passenger_details, ticket_info, on='passenger_id', how='outer')
print("\nOuter Join (all records from both tables):")
print(outer_merge)

8.2 Different Types of Merges:
------------------------------
Inner Join (only matching records):
   passenger_id           name  ticket_class ticket_number  fare_paid
0             1  Alice Johnson             1          A123        100
1             2      Bob Smith             2          B456         75
2             3  Charlie Brown             3          C789         50

Left Join (all records from left table):
   passenger_id           name  ticket_class ticket_number  fare_paid
0             1  Alice Johnson             1          A123      100.0
1             2      Bob Smith             2          B456       75.0
2             3  Charlie Brown             3          C789       50.0
3             4   Diana Prince             1           NaN        NaN
4             5     Eve Wilson             2           NaN        NaN

Right Join (all records from right table):
   passenger_id           name  ticket_class ticket_number  fare_paid
0             1  Alice Johnson           1.0          A123        100
1             2      Bob Smith           2.0          B456         75
2             3  Charlie Brown           3.0          C789         50
3             6            NaN           NaN          D012        120
4             7            NaN           NaN          E345         80

Outer Join (all records from both tables):
   passenger_id           name  ticket_class ticket_number  fare_paid
0             1  Alice Johnson           1.0          A123      100.0
1             2      Bob Smith           2.0          B456       75.0
2             3  Charlie Brown           3.0          C789       50.0
3             4   Diana Prince           1.0           NaN        NaN
4             5     Eve Wilson           2.0           NaN        NaN
5             6            NaN           NaN          D012      120.0
6             7            NaN           NaN          E345       80.0

In [39]:
print("\n8.3 Merge with Different Column Names:")
print("-" * 30)

# Create data with different column names
passenger_info = pd.DataFrame({
    'id': [1, 2, 3],
    'passenger_name': ['Alice', 'Bob', 'Charlie']
})

booking_info = pd.DataFrame({
    'passenger_id': [1, 2, 4],
    'booking_date': ['2024-01-01', '2024-01-02', '2024-01-03']
})

# Merge with different column names
merge_diff_names = pd.merge(passenger_info, booking_info,
                          left_on='id', right_on='passenger_id', how='inner')
print("Merge with different column names:")
print(merge_diff_names)

8.3 Merge with Different Column Names:
------------------------------
Merge with different column names:
   id passenger_name  passenger_id booking_date
0   1          Alice             1   2024-01-01
1   2            Bob             2   2024-01-02

In [40]:
print("\n8.4 Concatenation:")
print("-" * 30)

# Concatenate DataFrames vertically
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

concat_vertical = pd.concat([df1, df2], ignore_index=True)
print("Vertical concatenation:")
print(concat_vertical)

# Concatenate horizontally
concat_horizontal = pd.concat([df1, df2], axis=1)
print("\nHorizontal concatenation:")
print(concat_horizontal)

8.4 Concatenation:
------------------------------
Vertical concatenation:
   A  B
0  1  3
1  2  4
2  5  7
3  6  8

Horizontal concatenation:
   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [41]:
# =============================================================================
# 9. PIVOT TABLES AND RESHAPING
# =============================================================================

print("\n" + "="*60)
print("9. PIVOT TABLES AND RESHAPING")
print("="*60)

print("\n9.1 Pivot Tables:")
print("-" * 30)

# Create a pivot table
if 'Sex' in titanic_clean.columns and 'Pclass' in titanic_clean.columns and 'Survived' in titanic_clean.columns:
    pivot_survival = pd.pivot_table(
        titanic_clean,
        values='Survived',
        index='Sex',
        columns='Pclass',
        aggfunc='mean',
        fill_value=0
    )
    print("Survival rate by sex and class (Pivot Table):")
    print(pivot_survival)

============================================================
9. PIVOT TABLES AND RESHAPING
============================================================

9.1 Pivot Tables:
------------------------------
Survival rate by sex and class (Pivot Table):
Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [42]:

# Pivot table with multiple values
if 'Age' in titanic_clean.columns and 'Fare' in titanic_clean.columns:
    pivot_multiple = pd.pivot_table(
        titanic_clean,
        values=['Age', 'Fare'],
        index='Sex',
        columns='Pclass',
        aggfunc='mean',
        fill_value=0
    )
    print("\nAge and Fare by sex and class:")
    print(pivot_multiple)

Age and Fare by sex and class:
              Age                              Fare
Pclass          1          2          3           1          2          3
Sex
female  33.978723  28.703947  23.572917  106.125798  21.970121  16.118810
male    38.995246  30.512315  26.911873   67.226127  19.741782  12.661633

In [43]:
# =============================================================================
# 10. ADVANCED OPERATIONS
# =============================================================================

print("\n" + "="*60)
print("10. ADVANCED OPERATIONS")
print("="*60)

print("\n10.1 Index Operations:")
print("-" * 30)

# Set index
if 'Age' in titanic_clean.columns:
    df_with_index = titanic_clean.copy()
    df_with_index = df_with_index.set_index('Age')
    print(f"Shape after setting age as index: {df_with_index.shape}")
    print("First few rows with age as index:")
    print(df_with_index.head(3))

    # Reset index
    df_reset = df_with_index.reset_index()
    print(f"\nShape after resetting index: {df_reset.shape}")

============================================================
10. ADVANCED OPERATIONS
============================================================

10.1 Index Operations:
------------------------------
Shape after setting age as index: (891, 11)
First few rows with age as index:
      PassengerId  Survived  Pclass  \
Age
22.0            1         0       3
38.0            2         1       1
26.0            3         1       3

                                                   Name     Sex  SibSp  Parch  \
Age
22.0                            Braund, Mr. Owen Harris    male      1      0
38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female      1      0
26.0                             Heikkinen, Miss. Laina  female      0      0

                Ticket     Fare Cabin Embarked
Age
22.0         A/5 21171   7.2500   NaN        S
38.0          PC 17599  71.2833   C85        C
26.0  STON/O2. 3101282   7.9250   NaN        S

Shape after resetting index: (891, 12)

In [44]:
print("\n10.2 Apply Lambda Functions:")
print("-" * 30)

# Apply function to create new columns
if 'Age' in titanic_clean.columns:
    titanic_clean['Age_group'] = titanic_clean['Age'].apply(
        lambda x: 'Child' if x < 18 else ('Adult' if x < 60 else 'Senior')
    )

    print("Age group distribution:")
    print(titanic_clean['Age_group'].value_counts())

# Apply function to multiple columns
def categorize_passenger(row):
    if row['Pclass'] == 1:
        return 'First Class'
    elif row['Pclass'] == 2:
        return 'Second Class'
    else:
        return 'Third Class'

titanic_clean['class_name'] = titanic_clean.apply(categorize_passenger, axis=1)
print("\nClass name distribution:")
print(titanic_clean['class_name'].value_counts())

10.2 Apply Lambda Functions:
------------------------------
Age group distribution:
Age_group
Adult     752
Child     113
Senior     26
Name: count, dtype: int64

Class name distribution:
class_name
Third Class     491
First Class     216
Second Class    184
Name: count, dtype: int64

In [45]:
print("\n10.3 Working with Dates:")
print("-" * 30)

# Create sample date data
date_range = pd.date_range(start='2024-01-01', end='2024-01-10', freq='D')
date_df = pd.DataFrame({
    'date': date_range,
    'value': np.random.randn(len(date_range))
})

print("Sample date data:")
print(date_df.head())

# Extract date components
date_df['year'] = date_df['date'].dt.year
date_df['month'] = date_df['date'].dt.month
date_df['dayofweek'] = date_df['date'].dt.dayofweek
date_df['weekday_name'] = date_df['date'].dt.day_name()

print("\nDate with extracted components:")
print(date_df[['date', 'year', 'month', 'dayofweek', 'weekday_name']].head())

10.3 Working with Dates:
------------------------------
Sample date data:
        date     value
0 2024-01-01  0.383791
1 2024-01-02 -0.015432
2 2024-01-03  0.581278
3 2024-01-04 -0.298356
4 2024-01-05  1.419236

Date with extracted components:
        date  year  month  dayofweek weekday_name
0 2024-01-01  2024      1          0       Monday
1 2024-01-02  2024      1          1      Tuesday
2 2024-01-03  2024      1          2    Wednesday
3 2024-01-04  2024      1          3     Thursday
4 2024-01-05  2024      1          4       Friday

In [46]:
print("\n10.4 Data Validation and Quality Checks:")
print("-" * 30)

# Check for duplicates
duplicates = titanic_clean.duplicated().sum()
print(f"Number of duplicate rows: {duplicates}")

# Check data ranges
if 'Age' in titanic_clean.columns:
    invalid_ages = titanic_clean[(titanic_clean['Age'] < 0) | (titanic_clean['Age'] > 150)]
    print(f"Invalid ages (< 0 or > 150): {len(invalid_ages)}")

# Memory usage
print(f"\nDataset memory usage: {titanic_clean.memory_usage(deep=True).sum() / 1024:.2f} KB")

10.4 Data Validation and Quality Checks:
------------------------------
Number of duplicate rows: 0
Invalid ages (< 0 or > 150): 0

Dataset memory usage: 428.40 KB

In [47]:
print("\n" + "="*60)
print("SUMMARY AND BEST PRACTICES")
print("="*60)

print("""
Key Pandas Concepts Covered:
1. Series and DataFrame creation and manipulation
2. Data loading and exploration
3. Data selection and indexing (iloc, loc)
4. Missing value handling (dropna, fillna)
5. Data filtering and querying (isin, query)
6. Aggregation and grouping operations
7. Data merging and joining
8. Pivot tables and data reshaping
9. Advanced operations (apply, dates)

Next Steps:
- Practice with different datasets
""")

# Final dataset summary
print(f"\nFinal cleaned dataset shape: {titanic_clean.shape}")
print(f"Columns: {titanic_clean.columns.tolist()}")
print("\nData cleaning complete! Dataset ready for analysis.")

============================================================
SUMMARY AND BEST PRACTICES
============================================================

Key Pandas Concepts Covered:
1. Series and DataFrame creation and manipulation
2. Data loading and exploration
3. Data selection and indexing (iloc, loc)
4. Missing value handling (dropna, fillna)
5. Data filtering and querying (isin, query)
6. Aggregation and grouping operations
7. Data merging and joining
8. Pivot tables and data reshaping
9. Advanced operations (apply, dates)

Next Steps:
- Practice with different datasets


Final cleaned dataset shape: (891, 14)
Columns: ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_group', 'class_name']

Data cleaning complete! Dataset ready for analysis.